<?xml version="1.0" ?>
<net name="saved_model" version="10">
	<layers>
		<layer id="0" name="conv2d_input" type="Parameter" version="opset1">
			<data shape="1,1,28,28" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="Func/StatefulPartitionedCall/input/_0:0,conv2d_input:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data offset="0" size="300" shape="6,1,5,5" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp:0">
					<dim>6</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="StatefulPartitionedCall/sequential/conv2d/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>6</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/sequential/conv2d/Conv2D:0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data offset="300" size="12" shape="1,6,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/sequential/conv2d/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/sequential/conv2d/BiasAdd:0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/sequential/conv2d/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="StatefulPartitionedCall/sequential/conv2d/Relu:0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/sequential/max_pooling2d/MaxPool" type="MaxPool" version="opset1">
			<data strides="2,2" kernel="2,2" pads_begin="0,0" pads_end="0,0" auto_pad="valid"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="StatefulPartitionedCall/sequential/max_pooling2d/MaxPool:0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data offset="312" size="4800" shape="16,6,5,5" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp:0">
					<dim>16</dim>
					<dim>6</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/sequential/conv2d_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>6</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/sequential/conv2d_1/Conv2D:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data offset="5112" size="32" shape="1,16,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/sequential/conv2d_1/BiasAdd:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/sequential/conv2d_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="StatefulPartitionedCall/sequential/conv2d_1/Relu:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/sequential/max_pooling2d_1/MaxPool" type="MaxPool" version="opset1">
			<data strides="2,2" kernel="2,2" pads_begin="0,0" pads_end="0,0" auto_pad="valid"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/sequential/max_pooling2d_1/MaxPool/Transpose/value5751016" type="Const" version="opset1">
			<data offset="5144" size="32" shape="4" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/sequential/max_pooling2d_1/MaxPool/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/sequential/max_pooling2d_1/MaxPool:0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/sequential/flatten/Const" type="Const" version="opset1">
			<data offset="5176" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/sequential/flatten/Const:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/sequential/flatten/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/sequential/flatten/Reshape:0">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp" type="Const" version="opset1">
			<data offset="5192" size="96000" shape="120,400" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp:0">
					<dim>120</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/sequential/dense/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>400</dim>
				</port>
				<port id="1">
					<dim>120</dim>
					<dim>400</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/sequential/dense/MatMul:0">
					<dim>1</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data offset="101192" size="240" shape="1,120" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/sequential/dense/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/sequential/dense/BiasAdd:0">
					<dim>1</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/sequential/dense/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="StatefulPartitionedCall/sequential/dense/Relu:0">
					<dim>1</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp" type="Const" version="opset1">
			<data offset="101432" size="20160" shape="84,120" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp:0">
					<dim>84</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/sequential/dense_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>84</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/sequential/dense_1/MatMul:0">
					<dim>1</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data offset="121592" size="168" shape="1,84" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/sequential/dense_1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/sequential/dense_1/BiasAdd:0">
					<dim>1</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/sequential/dense_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="StatefulPartitionedCall/sequential/dense_1/Relu:0">
					<dim>1</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp" type="Const" version="opset1">
			<data offset="121760" size="1680" shape="10,84" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp:0">
					<dim>10</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/sequential/dense_2/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
				</port>
				<port id="1">
					<dim>10</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/sequential/dense_2/MatMul:0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data offset="123440" size="20" shape="1,10" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/sequential/dense_2/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="StatefulPartitionedCall/sequential/dense_2/BiasAdd:0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/sequential/dense_2/Softmax" type="SoftMax" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="Func/StatefulPartitionedCall/output/_11:0,Identity:0,StatefulPartitionedCall/Identity:0,StatefulPartitionedCall/sequential/dense_2/Softmax:0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Func/StatefulPartitionedCall/output/_11:0" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
		<edge from-layer="3" from-port="0" to-layer="4" to-port="1"/>
		<edge from-layer="4" from-port="2" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="1" to-layer="6" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="8" to-port="0"/>
		<edge from-layer="7" from-port="0" to-layer="8" to-port="1"/>
		<edge from-layer="8" from-port="2" to-layer="10" to-port="0"/>
		<edge from-layer="9" from-port="0" to-layer="10" to-port="1"/>
		<edge from-layer="10" from-port="2" to-layer="11" to-port="0"/>
		<edge from-layer="11" from-port="1" to-layer="12" to-port="0"/>
		<edge from-layer="12" from-port="1" to-layer="14" to-port="0"/>
		<edge from-layer="13" from-port="0" to-layer="14" to-port="1"/>
		<edge from-layer="14" from-port="2" to-layer="16" to-port="0"/>
		<edge from-layer="15" from-port="0" to-layer="16" to-port="1"/>
		<edge from-layer="16" from-port="2" to-layer="18" to-port="0"/>
		<edge from-layer="17" from-port="0" to-layer="18" to-port="1"/>
		<edge from-layer="18" from-port="2" to-layer="20" to-port="0"/>
		<edge from-layer="19" from-port="0" to-layer="20" to-port="1"/>
		<edge from-layer="20" from-port="2" to-layer="21" to-port="0"/>
		<edge from-layer="21" from-port="1" to-layer="23" to-port="0"/>
		<edge from-layer="22" from-port="0" to-layer="23" to-port="1"/>
		<edge from-layer="23" from-port="2" to-layer="25" to-port="0"/>
		<edge from-layer="24" from-port="0" to-layer="25" to-port="1"/>
		<edge from-layer="25" from-port="2" to-layer="26" to-port="0"/>
		<edge from-layer="26" from-port="1" to-layer="28" to-port="0"/>
		<edge from-layer="27" from-port="0" to-layer="28" to-port="1"/>
		<edge from-layer="28" from-port="2" to-layer="30" to-port="0"/>
		<edge from-layer="29" from-port="0" to-layer="30" to-port="1"/>
		<edge from-layer="30" from-port="2" to-layer="31" to-port="0"/>
		<edge from-layer="31" from-port="1" to-layer="32" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2021.4.2-3976-0943ed67223-refs/pull/539/head"/>
		<cli_parameters>
			<batch value="1"/>
			<caffe_parser_path value="DIR"/>
			<data_type value="FP16"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V7 value="False"/>
			<input_model_is_text value="False"/>
			<k value="DIR/CustomLayersMapping.xml"/>
			<keep_shape_ops value="True"/>
			<legacy_ir_generation value="False"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="saved_model"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<progress value="False"/>
			<remove_memory value="False"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<saved_model_dir value="DIR"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<static_shape value="False"/>
			<stream_output value="False"/>
			<transform value=""/>
			<unset unset_cli_parameters="counts, disable_fusing, disable_gfusing, finegrain_fusing, input, input_checkpoint, input_meta_graph, input_model, input_proto, input_shape, input_symbol, mean_file, mean_file_offsets, move_to_preprocess, nd_prefix_name, output, placeholder_shapes, pretrained_model_name, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
